def convert(txt):
    convert_table = {
        'a': ('あ', 'ア'), 'i': ('い', 'イ'), 'u': ('う', 'ウ'), 'e': ('え', 'エ'), 'o': ('お', 'オ'),
        'ka': ('か', 'カ'), 'ki': ('き', 'キ'), 'ku': ('く', 'ク'), 'ke': ('け', 'ケ'), 'ko': ('こ', 'コ'),
        'sa': ('さ', 'サ'), 'shi': ('し', 'シ'), 'su': ('す', 'ス'), 'se': ('せ', 'セ'), 'so': ('そ', 'ソ'),
        'ta': ('た', 'タ'), 'chi': ('ち', 'チ'), 'tsu': ('つ', 'ツ'), 'te': ('て', 'テ'), 'to': ('と', 'ト'),
        'na': ('な', 'ナ'), 'ni': ('に', 'ニ'), 'nu': ('ぬ', 'ヌ'), 'ne': ('ね', 'ネ'), 'no': ('の', 'ノ'),
        'ha': ('は', 'ハ'), 'hi': ('ひ', 'ヒ'), 'fu': ('ふ', 'フ'), 'he': ('へ', 'ヘ'), 'ho': ('ほ', 'ホ'),
        'ma': ('ま', 'マ'), 'mi': ('み', 'ミ'), 'mu': ('む', 'ム'), 'me': ('め', 'メ'), 'mo': ('も', 'モ'),
        'ya': ('や', 'ヤ'), 'yu': ('ゆ', 'ユ'), 'yo': ('よ', 'ヨ'),
        'ra': ('ら', 'ラ'), 'ri': ('り', 'リ'), 'ru': ('る', 'ル'), 're': ('れ', 'レ'), 'ro': ('ろ', 'ロ'),
        'wa': ('わ', 'ワ'), 'wo': ('を', 'ヲ'),
        'n': ('ん', 'ン'),
        'ga': ('が', 'ガ'), 'gi': ('ぎ', 'ギ'), 'gu': ('ぐ', 'グ'), 'ge': ('げ', 'ゲ'), 'go': ('ご', 'ゴ'),
        'za': ('ざ', 'ザ'), 'ji': ('じ', 'ジ'), 'zu': ('ず', 'ズ'), 'ze': ('ぜ', 'ゼ'), 'zo': ('ぞ', 'ゾ'),
        'da': ('だ', 'ダ'), 'di': ('ぢ', 'ヂ'), 'du': ('づ', 'ヅ'), 'de': ('で', 'デ'), 'do': ('ど', 'ド'),
        'ba': ('ば', 'バ'), 'bi': ('び', 'ビ'), 'bu': ('ぶ', 'ブ'), 'be': ('べ', 'ベ'), 'bo': ('ぼ', 'ボ'),
        'pa': ('ぱ', 'パ'), 'pi': ('ぴ', 'ピ'), 'pu': ('ぷ', 'プ'), 'pe': ('ぺ', 'ペ'), 'po': ('ぽ', 'ポ'),
        'kya': ('きゃ', 'キャ'), 'kyu': ('きゅ', 'キュ'), 'kyo': ('きょ', 'キョ'),
        'sha': ('しゃ', 'シャ'), 'shu': ('しゅ', 'シュ'), 'sho': ('しょ', 'ショ'),
        'cha': ('ちゃ', 'チャ'), 'chu': ('ちゅ', 'チュ'), 'cho': ('ちょ', 'チョ'),
        'nya': ('にゃ', 'ニャ'), 'nyu': ('にゅ', 'ニュ'), 'nyo': ('にょ', 'ニョ'),
        'hya': ('ひゃ', 'ヒャ'), 'hyu': ('ひゅ', 'ヒュ'), 'hyo': ('ひょ', 'ヒョ'),
        'mya': ('みゃ', 'ミャ'), 'myu': ('みゅ', 'ミュ'), 'myo': ('みょ', 'ミョ'),
        'rya': ('りゃ', 'リャ'), 'ryu': ('りゅ', 'リュ'), 'ryo': ('りょ', 'リョ'),
        'gya': ('ぎゃ', 'ギャ'), 'gyu': ('ぎゅ', 'ギュ'), 'gyo': ('ぎょ', 'ギョ'),
        'ja': ('じゃ', 'ジャ'), 'ju': ('じゅ', 'ジュ'), 'jo': ('じょ', 'ジョ'),
        'bya': ('びゃ', 'ビャ'), 'byu': ('びゅ', 'ビュ'), 'byo': ('びょ', 'ビョ'),
        'pya': ('ぴゃ', 'ピャ'), 'pyu': ('ぴゅ', 'ピュ'), 'pyo': ('ぴょ', 'ピョ')
    }

    romaji = txt.replace(' ', '')
    hiragana = katakana = ''
    r = len(romaji)
    i = 0
    while i < r:
        syllable = ''
        while syllable not in convert_table:
            # small tsu
            if romaji[i] not in 'aiueon' and romaji[i] == romaji[i + 1]:
                hiragana += 'っ'
                katakana += 'ッ'
                i += 1
            syllable += romaji[i]
            i += 1
            if syllable == 'n':
                if i == r:
                    break
                elif romaji[i] in 'aiueo':
                    syllable += romaji[i]
                    i += 1

        hiragana += convert_table[syllable][0]
        katakana += convert_table[syllable][1]

    return {'romaji': romaji, 'hiragana': hiragana, 'katakana': katakana}


if __name__ == '__main__':
    tr = convert('jojo no kimyo na bouken')

    for key in tr:
        print(f'{key}: {tr[key]}')
